algorithms/SliceOperator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-04 Fri 15:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title><code>SliceOperator</code></title>
<meta name="generator" content="Org mode" />

    <meta charset='UTF-8'>
    <meta name='apple-mobile-web-app-capable' content='yes'>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <link
      href='https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css'
      rel='stylesheet'
      integrity='sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU'
      crossorigin='anonymous'>
</head>
<body>
<div id="preamble" class="status">

 <nav class='navbar navbar-expand-md navbar-light bg-light'>
   <div class='container-fluid'>
     <a class='navbar-brand' href='#'>
       Cc4s
     </a>
     <button class='navbar-toggler' type='button'
             data-bs-toggle='collapse'
             data-bs-target='#navbarSupportedContent'
             aria-controls='navbarSupportedContent'
             aria-expanded='false'
             aria-label='Toggle navigation'>
       <span class='navbar-toggler-icon'></span>
     </button>
     <div class='collapse navbar-collapse' id='navbarSupportedContent'>
       <ul class='navbar-nav me-auto mb-2 mb-lg-0'>
         <li class='nav-item'>
           <a class='nav-link' aria-current='page' href='/user-manual/index.html'>
             <i class='fa fa-home'></i>
             Home
           </a>
         </li>
         <li class='nav-item'>
           <a class='nav-link' href='/user-manual/sitemap.html'>
             <i class='fa fa-sign-out'></i>
             Sitemap
           </a>
         </li>
         <li class='nav-item'>
           <a class='nav-link' href='/user-manual/algorithms/sitemap.html'>
             <i class='fa fa-sign-out'></i>
             Algorithms
           </a>
         </li>
         <li class='nav-item'>
           <a class='nav-link' href='/user-manual/objects/sitemap.html'>
             <i class='fa fa-sign-out'></i>
             Objects
           </a>
         </li>
       </ul>
     </div>
   </div>
 </nav>
</div>
<div id="content">
<h1 class="title"><code>SliceOperator</code></h1>

<div id="outline-container-orgd560766" class="outline-2">
<h2 id="orgd560766"><span class="section-number-2">1</span> <a href="#orgd560766">Brief description</a></h2>
<div class="outline-text-2" id="text-1">
<p>
This algorithm splits all edges of an input tensor of type orbital and size \(N_p\)
in sizes of \(N_o\) and \(N_v\). It uses <code>slicedEigenEnergies</code> to identify
the number of holes \(N_o\) and particles \(N_v\). The output tensor will be a set of
\(2^n\) tensors, where n is the number of edges with type orbital. For instance
the Coulomb Vertex will be processed like
\(\Gamma_p^p(G) \rightarrow \{ \Gamma_o^o(G), \Gamma_o^v(G), \Gamma_v^o(G), \Gamma_v^v(G)\}\).
</p>
</div>
</div>

<div id="outline-container-org6927be4" class="outline-2">
<h2 id="org6927be4"><span class="section-number-2">2</span> <a href="#org6927be4">Algorithm call</a></h2>
<div class="outline-text-2" id="text-2">
<p>
A typical input file snippet to call the <a href="SliceOperator.html#ID-SliceOperator">SliceOperator</a>
algorithm is given below.
</p>

<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #8b4513;">name</span>: SliceOperator
  <span style="color: #8b4513;">in</span>:
    <span style="color: #8b4513;">slicedEigenEnergies</span>: EigenEnergies
    <span style="color: #8b4513;">operator</span>: CoulombVertex
  <span style="color: #8b4513;">out</span>:
    <span style="color: #8b4513;">slicedOperator</span>: CoulombVertex
</pre>
</div>
</div>
</div>


<div id="outline-container-orgbff8613" class="outline-2">
<h2 id="orgbff8613"><span class="section-number-2">3</span> <a href="#orgbff8613">Algorithm input</a></h2>
<div class="outline-text-2" id="text-3">
<table id="orgb0583d1" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keyword</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>operator</code></td>
<td class="org-left"><a href="#operator">Operator</a></td>
</tr>

<tr>
<td class="org-left"><code>slicedEigenEnergies</code></td>
<td class="org-left"><a href="../objects/SlicedEigenEnergies.html#ID-SlicedEigenEnergies">SlicedEigenEnergies</a></td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-operator" class="outline-3">
<h3 id="operator"><span class="section-number-3">3.1</span> <a href="#operator">operator</a></h3>
<div class="outline-text-3" id="text-operator">
<p>
This is a single tensor.
</p>
</div>
</div>
</div>

<div id="outline-container-org4e14916" class="outline-2">
<h2 id="org4e14916"><span class="section-number-2">4</span> <a href="#org4e14916">Algorithm output</a></h2>
<div class="outline-text-2" id="text-4">
<table id="org1e9c459" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keyword</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>slicedOperator</code></td>
<td class="org-left"><a href="#slicedOperator">SlicedOperator</a></td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-slicedOperator" class="outline-3">
<h3 id="slicedOperator"><span class="section-number-3">4.1</span> <a href="#slicedOperator">slicedOperator</a></h3>
<div class="outline-text-3" id="text-slicedOperator">
<p>
This is a set of tensors.
</p>
</div>
</div>

<div id="outline-container-org4e5882d" class="outline-3">
<h3 id="org4e5882d"><span class="section-number-3">4.2</span> <a href="#org4e5882d">Sample <code>stdout</code></a></h3>
<div class="outline-text-3" id="text-4-2">
<p>
The output of this algorithm reads
</p>
<div class="org-src-container">
<pre class="src src-sh">step: 4, SliceOperator
Slicing CoulombVertex.dat into holes and particles.
realtime 0.000798066 s
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda5afa4" class="outline-3">
<h3 id="orgda5afa4"><span class="section-number-3">4.3</span> <a href="#orgda5afa4">Sample <code>yaml</code> output</a></h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8b4513;">floatingPointOperations</span>: 0
<span style="color: #8b4513;">flops</span>: 0
<span style="color: #8b4513;">in</span>:
  <span style="color: #8b4513;">operator</span>: 0x24878e8
  <span style="color: #8b4513;">slicedEigenEnergies</span>: 0x2487f38
<span style="color: #8b4513;">name</span>: SliceOperator
<span style="color: #8b4513;">out</span>:
  <span style="color: #8b4513;">slicedOperator</span>: 0x24aee28
<span style="color: #8b4513;">realtime</span>: 0.002082513
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org27aeae9" class="outline-2">
<h2 id="org27aeae9"><span class="section-number-2">5</span> <a href="#org27aeae9">Literature</a></h2>
<div class="outline-text-2" id="text-5">
<div class="csl-bib-body">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-02-04 Fri 15:42</p>
</div>
</body>
</html>
